/**
⢀⣀⠀⠀⠀⠰⣶⡖⠲⠦⠤⣿⣝⠲⣤⣄⡀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠸⣿⡉⠛⣒⠲⠾⡟⠓⠒⠲⡾⢿⣿⢿⡦⣍⠻⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠹⣟⢄⡈⠙⠢⠤⣀⣀⣀⣙⣦⣙⠻⢦⣌⡳⠄⣿⣮⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⣿⡷⣝⡢⠄⢰⡚⠛⠓⠒⠤⠬⣿⡶⠬⡅⠘⢿⣷⠀⣻⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠹⣗⣤⣽⡦⠄⠙⢦⣀⠀⠀⠀⢻⠘⣆⢰⣒⣦⣤⣼⣍⡿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠈⠙⣿⢯⣔⣒⣀⣈⠿⠒⣀⡤⠒⠋⠉⠁⠀⠀⠀⠉⣿⡘⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠿⠷⢶⡞⠋⠉⢩⠤⠞⠁⠀⠀⠀⢀⣀⣤⠤⠲⣞⣿⣷⠸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⣀⣀⣀⣠⠤⠤⠖⢒⣿⠿⠟⠛⠂⠀⢹⣿⣿⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠸⣿⣻⡠⠤⣤⣴⣦⡀⠉⠁⠴⣿⠟⠀⠀⠀⣿⠏⠀⠀⠑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢻⣿⣇⠀⠛⠛⠁⣇⣀⣤⡤⠤⠤⠤⢰⡾⠃⠀⠀⢀⣀⡈⢣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣤⡤⠖⣫⠵⢷⠚⠛⢻⠉⣹⠋⠀⣠⠔⢊⣁⡤⠤⠌⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣷⠚⠉⢱⠀⠸⡄⠀⣠⠟⠁⠴⣫⠔⠊⠁⠀⠀⠀⠀⠈⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣇⠀⠀⠇⠀⣱⠞⠁⠀⡠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡿⣆⠀⢠⠞⠁⠀⡠⠊⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⠤⠔⠒⠚⠓⠒⠤⣄⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⡿⠁⠈⡶⠃⢀⡴⠊⠀⠀⠀⠀⠀⣠⠴⠚⠉⣠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢆⠀⠀
⠀⠀⠀⠀⠀⠀⢰⣿⣿⠟⠀⢀⠞⠁⠐⠋⠀⠀⠀⠀⣠⢴⡎⠁⠀⠀⡴⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀
⠀⠀⠀⠀⠀⠀⠈⢿⡇⠀⢠⣏⣠⠞⠀⠀⠀⢀⡴⠊⠁⠀⠳⠀⢀⡜⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇
⠀⠀⠀⠀⠀⠀⠀⠘⣷⠀⠸⠈⠀⠀⢀⡤⠖⠉⠀⣠⠆⠀⠀⢀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⢀⡴⠋⢹⣆⣀⣠⣤⠒⠙⡇⣠⠔⠋⠀⠀⠀⠀⣸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⡞⠀⢀⠼⡇⢰⣾⣿⣷⡴⣟⠁⠀⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⣇⡴⢁⡴⣇⣨⣼⣿⠋⠀⠈⠀⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃
⠀⠀⠀⠀⠀⠉⠀⠈⠀⠈⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
 Copyright (C) 2023
 Licensed under the  GPL-3.0 License;
 You may not use this file except in compliance with the License.
 It is supplied in the hope that it may be useful.
 * @project_name : Dark Nero V9
 * @description : Dark Nero V9,A Multi-functional whatsapp bot.
 **/

const { tlang, botpic, cmd, prefix, runtime, Config, formatp, fetchJson } = require('../lib')
const { download} = require('aptoide-scraper')
cmd({
    pattern: "downapk",
    alias: ["ps","apk","playstore"],
    desc: "download playstore app",
    react: "🤹",
    category: "downloader",
    filename: __filename,
},
async (Void, citel, text) => {
if (!text) return
try {
let result = await download(text)
 const applink = result.dllink
    const getname = result.name
    const icon = result.icon
    const lastupdate = result.lastup
    const packagename = result.package
    const size = result.size
      await Void.sendMessage(citel.chat, {
        image: {
            url: icon,
        },
        caption: `      
 \n━━━━━━━━━━━━━━━
  ᴀᴘᴘ ɪɴꜰᴏ
━━━━━━━━━━━━━━━┓       
\n|:̵🥷⃫⃨⃨⃨⃖⃗⃡⃜⃛⃟🎋̟⎝⃝࿐ ᴘʟᴀʏ ꜱᴛᴏʀᴇ ᴅᴏᴡɴʟᴏᴀᴅ           
\n|:̵🥷⃫⃨⃨⃨⃖⃗⃡⃜⃛⃟🎋̟⎝⃝࿐ ᴀᴘᴘ ɴᴀᴍᴇ: ${getname}           
\n|:̵🥷⃫⃨⃨⃨⃖⃗⃡⃜⃛⃟🎋̟⎝⃝࿐ ʟᴀꜱᴛ ᴜᴘᴅᴀᴛᴇ: ${lastupdate}          
\n|:̵🥷⃫⃨⃨⃨⃖⃗⃡⃜⃛⃟🎋̟⎝⃝࿐ ᴘᴀᴄᴋᴀɢᴇ ɴᴀᴍᴇ: ${packagename}             
\n|:̵🥷⃫⃨⃨⃨⃖⃗⃡⃜⃛⃟🎋̟⎝⃝࿐ ꜰɪʟᴇ ꜱɪᴢᴇ: ${size} 
\n━━━━━━━━━━━━━━━┛
     ©ᴅᴀʀᴋ ɴᴇʀᴏ ᴠ9 ᴀᴘᴋ ᴅᴏᴡɴʟᴏᴅ`,
    })
    return Void.sendMessage(citel.chat, {
        document: {
            url: applink,
        },
        mimetype: "application/vnd.android.package-archive",
        fileName: getname,
    }, {
        quoted: citel,
    });
  } catch (err) {
    console.error(err);
    citel.reply(`*🥷⃟❌ An error occurred while processing your request. Please try again later.${err}*`);
  }
})
