/**
⢀⣀⠀⠀⠀⠰⣶⡖⠲⠦⠤⣿⣝⠲⣤⣄⡀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠸⣿⡉⠛⣒⠲⠾⡟⠓⠒⠲⡾⢿⣿⢿⡦⣍⠻⣷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠹⣟⢄⡈⠙⠢⠤⣀⣀⣀⣙⣦⣙⠻⢦⣌⡳⠄⣿⣮⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⣿⡷⣝⡢⠄⢰⡚⠛⠓⠒⠤⠬⣿⡶⠬⡅⠘⢿⣷⠀⣻⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠹⣗⣤⣽⡦⠄⠙⢦⣀⠀⠀⠀⢻⠘⣆⢰⣒⣦⣤⣼⣍⡿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠈⠙⣿⢯⣔⣒⣀⣈⠿⠒⣀⡤⠒⠋⠉⠁⠀⠀⠀⠉⣿⡘⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠿⠷⢶⡞⠋⠉⢩⠤⠞⠁⠀⠀⠀⢀⣀⣤⠤⠲⣞⣿⣷⠸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢸⣿⣀⣀⣀⣠⠤⠤⠖⢒⣿⠿⠟⠛⠂⠀⢹⣿⣿⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠸⣿⣻⡠⠤⣤⣴⣦⡀⠉⠁⠴⣿⠟⠀⠀⠀⣿⠏⠀⠀⠑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢻⣿⣇⠀⠛⠛⠁⣇⣀⣤⡤⠤⠤⠤⢰⡾⠃⠀⠀⢀⣀⡈⢣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣤⡤⠖⣫⠵⢷⠚⠛⢻⠉⣹⠋⠀⣠⠔⢊⣁⡤⠤⠌⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣷⠚⠉⢱⠀⠸⡄⠀⣠⠟⠁⠴⣫⠔⠊⠁⠀⠀⠀⠀⠈⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣇⠀⠀⠇⠀⣱⠞⠁⠀⡠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡿⣆⠀⢠⠞⠁⠀⡠⠊⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⠤⠔⠒⠚⠓⠒⠤⣄⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⡿⠁⠈⡶⠃⢀⡴⠊⠀⠀⠀⠀⠀⣠⠴⠚⠉⣠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢆⠀⠀
⠀⠀⠀⠀⠀⠀⢰⣿⣿⠟⠀⢀⠞⠁⠐⠋⠀⠀⠀⠀⣠⢴⡎⠁⠀⠀⡴⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀
⠀⠀⠀⠀⠀⠀⠈⢿⡇⠀⢠⣏⣠⠞⠀⠀⠀⢀⡴⠊⠁⠀⠳⠀⢀⡜⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡇
⠀⠀⠀⠀⠀⠀⠀⠘⣷⠀⠸⠈⠀⠀⢀⡤⠖⠉⠀⣠⠆⠀⠀⢀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⢀⡴⠋⢹⣆⣀⣠⣤⠒⠙⡇⣠⠔⠋⠀⠀⠀⠀⣸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⡞⠀⢀⠼⡇⢰⣾⣿⣷⡴⣟⠁⠀⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇
⠀⠀⠀⠀⠀⣇⡴⢁⡴⣇⣨⣼⣿⠋⠀⠈⠀⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃
⠀⠀⠀⠀⠀⠉⠀⠈⠀⠈⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
 Copyright (C) 2023
 Licensed under the  GPL-3.0 License;
 You may not use this file except in compliance with the License.
 It is supplied in the hope that it may be useful.
 * @project_name : Dark Nero V9
 * @description : Dark Nero V9,A Multi-functional whatsapp bot.
 **/

const { tlang, botpic, cmd, prefix, runtime, Config , sleep } = require('../lib')
const axios = require('axios')
const speed = require('performance-now')
const fetch = require('node-fetch');
//---------------------------------------------------------------------------
cmd({
        pattern: "owner",
	alias: ["owne "],
        desc: "To find owner number",
        category: "general",
        react: "🥷",
        filename: __filename
    },
    async(Void, citel) => {
        const Config = require('../config')
        const vcard = 'BEGIN:VCARD\n' +
            'VERSION:3.0\n' +
            'FN:' + Config.ownername + '\n' +
            'ORG:;\n' +
            'TEL;type=CELL;type=VOICE;waid=' + owner[0] + ':+' + owner[0] + '\n' +
            'END:VCARD'
        let buttonMessaged = {
            contacts: { displayName: Config.ownername, contacts: [{ vcard }] },
            contextInfo: {
                externalAdReply: {
                    title: Config.ownername,
                    body: 'DiLSAN-MD.',
                    renderLargerThumbnail: false,
                    thumbnailUrl: ``,
                    thumbnail: log0,
                    mediaType: 2,
                    mediaUrl: '',
                    sourceUrl: `https://wa.me/+` + owner[0] + '?text=Hii bro,I am ' + citel.pushName,
                },
            },
        };
        return await Void.sendMessage(citel.chat, buttonMessaged, {
            quoted: citel,
        });

    }
)

//---------------------------------------------------------------------------
cmd({
            pattern: "menu",
	alias: ["මෙනු", "help", "cmd"],
            react: "🥷",
            category: "general",
            filename: __filename,
            desc: "is bot alive??"
        },
        async(Void, citel, text, isAdmins) => {
            let alivemessage = Config.ALIVE_MESSAGE || `_*A bot developed by DiLSAN-MD*_`
            const alivtxt = `
🔥 *ᴍᴀɪɴ ᴄᴏᴍᴍᴀɴᴅ ʟɪꜱᴛ*🔥
┏━━━━━━━━━━━━━━━┓
|:̵🤹‍♂️⃟⃪♥️̟⎝⃝࿐ᴜᴘᴛɪᴍᴇ⇨ ${runtime(process.uptime())}
|:̵🤹‍♂️⃟⃪♥️̟⎝⃝࿐ᴍᴏᴅᴇ⇨ ${Config.WORKTYPE}
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
|🤺⃟⃪⃭⃐🥷 ${prefix}1 ♤ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ♤ 
|🤺⃟⃪⃭⃐🥷 ${prefix}2 ♤ɢʀᴏᴜᴘ ᴄᴏᴍᴍᴀɴᴅꜱ♤ 
|🤺⃟⃪⃭⃐🥷 ${prefix}3 ♤ᴏᴛʜᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ♤
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
©ᴅᴇᴠᴇʟᴏᴘᴇᴅ ʙʏ DiLSAN-MD
━━━━━━━━━━━━━━━━
`;
            let aliveMessage = {
                image: {
                    url: await botpic(),
                },
                caption: alivtxt,
                footer: tlang().footer,
                headerType: 4,
            };
            Void.sendMessage(citel.chat, aliveMessage, {
                quoted: citel,
            });
            
            await Void.sendMessage(citel.chat, { audio: {url: "https://raw.githubusercontent.com/Kaveeshasithum/Dark-Nero-Bot-MD/main/src/menu.aac" }, mimetype: 'audio/mp4', ptt: true, }, { quoted: citel })
        }
    )

cmd({
    pattern: "1",
alias: ["ownermenu", "01"],
    react: "📑",
    category: "general",
    filename: __filename,
    desc: "is bot alive??"
},
async(Void, citel, text) => {
    try{
var msg = citel	
if(!msg.quoted) return 
if (!msg.quoted.isBaileys ) return 
if(!msg.quoted.caption) return console.log('ew')
text = msg.quoted.caption
if (!text.includes('*ᴅᴀʀᴋ ɴᴇʀᴏ ᴠ9 ᴍᴀɪɴ ᴄᴏᴍᴍᴀɴᴅ ʟɪꜱᴛ*'))  return 

await Void.sendMessage(citel.chat, { react: {  text: "🤹‍♀️", key: msg.key } } )

    let alivemessage = Config.ALIVE_MESSAGE || `_*A bot developed by MR-HANSAMALA*_`
    const alivtxt = `
*ʜᴇʟʟᴏ ${citel.pushName}*
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
🤺⃟⃪⃭⃐🥷ᴜᴘᴛɪᴍᴇ⇨ ${runtime(process.uptime())}
🤺⃟⃪⃭⃐🥷ᴍᴏᴅᴇ⇨ ${Config.WORKTYPE}
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
♤ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ♤
▏▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁
| 🎋⃟🥷   ᴘʟᴜɢɪɴꜱ
| 🎋⃟🥷   ʀᴇᴍᴏᴠᴇ
| 🎋⃟🥷   ɪɴꜱᴛᴀʟʟ
| 🎋⃟🥷   ᴊᴏɪɴ
| 🎋⃟🥷   ᴜɴʙʟᴏᴄᴋ
| 🎋⃟🥷   ᴜᴊɪᴅ
| 🎋⃟🥷   ʙʟᴏᴄᴋ
| 🎋⃟🥷   ꜱᴀᴠᴇ
| 🎋⃟🥷   ᴅɴᴏᴛᴇ
| 🎋⃟🥷   ᴅᴀʟʟɴᴏᴛᴇ
| 🎋⃟🥷   ɢᴇᴛ
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
©ᴅᴇᴠᴇʟᴏᴘᴇᴅ ʙʏ ᴄʏʙᴇʀ ʏᴀᴋᴜᴢᴀ ᴛᴇᴀᴍ
━━━━━━━━━━━━━━━━
`;
                   let aliveMessage = {
                image: {
                    url: await botpic(),
                },
                caption: alivtxt,
                footer: tlang().footer,
                headerType: 4,
            };
             return Void.sendMessage(citel.chat, aliveMessage, {
                quoted: citel,
            });

        }catch(e){
			
	}}
    )




cmd({
    pattern: "2",
alias: ["groupmenu", "02"],
    react: "📑",
    category: "general",
    filename: __filename,
    desc: "is bot alive??"
},
async(Void, citel, text) => {
    try{
var msg = citel	
if(!msg.quoted) return 
if (!msg.quoted.isBaileys ) return 
if(!msg.quoted.caption) return console.log('ew')
text = msg.quoted.caption
if (!text.includes('*ᴅᴀʀᴋ ɴᴇʀᴏ ᴠ9 ᴍᴀɪɴ ᴄᴏᴍᴍᴀɴᴅ ʟɪꜱᴛ*'))  return 

await Void.sendMessage(citel.chat, { react: {  text: "🤹‍♀️", key: msg.key } } )
    let alivemessage = Config.ALIVE_MESSAGE || `_*A bot developed by MR-HANSAMALA*_`
    const alivtxt = `
*ʜᴇʟʟᴏ ${citel.pushName}*
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
🤺⃟⃪⃭⃐🥷ᴜᴘᴛɪᴍᴇ⇨ ${runtime(process.uptime())}
🤺⃟⃪⃭⃐🥷ᴍᴏᴅᴇ⇨ ${Config.WORKTYPE}
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
♤ɢʀᴏᴜᴘ ᴄᴏᴍᴍᴀɴᴅꜱ♤
▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁
| 🎋⃟🥷   ꜱᴛɪᴄᴋᴇʀ
| 🎋⃟🥷   ᴡᴀʀɴ
| 🎋⃟🥷   ᴛᴀɢᴀʟʟ
| 🎋⃟🥷   ʀᴇQᴜᴇꜱᴛ
| 🎋⃟🥷   ʀᴇᴛʀɪᴠᴇ
| 🎋⃟🥷   ʀᴇꜱᴇᴛᴡᴀʀɴ
| 🎋⃟🥷   ᴘᴏʟʟ
| 🎋⃟🥷   ᴘʀᴏꜰɪʟᴇ
| 🎋⃟🥷   ʀᴀɴᴋ
| 🎋⃟🥷   ᴘʀᴏᴍᴏᴛᴇ
| 🎋⃟🥷   ᴋɪᴄᴋ
| 🎋⃟🥷   ɢʀᴏᴜᴘ
| 🎋⃟🥷   ʙʀᴏᴅᴄᴀꜱᴛ
| 🎋⃟🥷   ᴀɴᴛɪʟɪɴᴋ
| 🎋⃟🥷   ᴀᴄᴛ
| 🎋⃟🥷   ᴅᴇᴀᴄᴛ
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
©ᴅᴇᴠᴇʟᴏᴘᴇᴅ ʙʏ ᴄʏʙᴇʀ ʏᴀᴋᴜᴢᴀ ᴛᴇᴀᴍ
━━━━━━━━━━━━━━━━
`;
let aliveMessage = {
    image: {
        url: await botpic(),
    },
    caption: alivtxt,
    footer: tlang().footer,
    headerType: 4,
};
 return Void.sendMessage(citel.chat, aliveMessage, {
    quoted: citel,
});

}catch(e){

}}
)


cmd({
    pattern: "3",
alias: ["othermenu", "03"],
    react: "📑",
    category: "general",
    filename: __filename,
    desc: "is bot alive??"
},
async(Void, citel, text) => {
    try{
var msg = citel	
if(!msg.quoted) return 
if (!msg.quoted.isBaileys ) return 
if(!msg.quoted.caption) return console.log('ew')
text = msg.quoted.caption
if (!text.includes('*ᴅᴀʀᴋ ɴᴇʀᴏ ᴠ9 ᴍᴀɪɴ ᴄᴏᴍᴍᴀɴᴅ ʟɪꜱᴛ*'))  return 

await Void.sendMessage(citel.chat, { react: {  text: "🤹‍♀️", key: msg.key } } )
    let alivemessage = Config.ALIVE_MESSAGE || `_*A bot developed by MR-HANSAMALA*_`
    const alivtxt = `
*ʜᴇʟʟᴏ ${citel.pushName}*
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
🤺⃟⃪⃭⃐🥷ᴜᴘᴛɪᴍᴇ⇨ ${runtime(process.uptime())}
🤺⃟⃪⃭⃐🥷ᴍᴏᴅᴇ⇨ ${Config.WORKTYPE}
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
♤ᴏᴛʜᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ♤
▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁
| 🎋⃟🥷   ᴇꜱᴀɴᴀ
| 🎋⃟🥷   ɴᴇᴡꜱ
┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
©ᴅᴇᴠᴇʟᴏᴘᴇᴅ ʙʏ ᴄʏʙᴇʀ ʏᴀᴋᴜᴢᴀ ᴛᴇᴀᴍ
━━━━━━━━━━━━━━━━
`;
let aliveMessage = {
    image: {
        url: await botpic(),
    },
    caption: alivtxt,
    footer: tlang().footer,
    headerType: 4,
};
 return Void.sendMessage(citel.chat, aliveMessage, {
    quoted: citel,
});

}catch(e){

}}
)
